begin
  var c:=readchar('Введите(капсом) «С» — север,«З» — запад, «Ю» — юг, «В» — восток');
  var n:=readinteger('Введите командy: 0 — продолжать движение, 1 — поворот налево, −1 — поворот направо');
  case c of
    'С': case n of
      1: c:='З';
      0: c:='С';
      -1: c:='В';
    end;
    'В': case n of
      1: c:='С';
      0: c:='В';
      -1: c:='Ю';
    end;
    'З': case n of
      1: c:='Ю';
      0: c:='З';
      -1: c:='С';
    end;
    'Ю': case n of
      1: c:='В';
      0: c:='Ю';
      -1: c:='З';
    end;
  end;
  println(c);
end.